# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: Вc ...

import room_1
for i in range(len(room_1.folks)):
    print('Room name "room_1" live:', room_1.folks[i])

